acaballero/etherlab/src/hw/stm32f4xx/eeprom.h
/**
 ******************************************************************************
 * @file    EEPROM/EEPROM_Emulation/inc/eeprom.h
 * @author  MCD Application Team
 * @brief   This file contains all the functions prototypes for the EEPROM
 *          emulation firmware library.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright � 2017 STMicroelectronics International N.V.
 * All rights reserved.</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other
 *    contributors to this software may be used to endorse or promote products
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under
 *    this license is void and will automatically terminate your rights under
 *    this license.
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __EEPROM_H
#define __EEPROM_H

/* Includes ------------------------------------------------------------------*/
#include "hw/stm32.h"

typedef enum {
    EE_OK = 0,
    EE_ERROR,
    EE_NO_VALID_PAGE,
    EE_ERASE_ERROR,
    EE_FORMAT_ERROR,
    EE_WRITE_ERROR,
    EE_ERROR_NOVALID_PAGE,
    EE_NO_DATA,
    EE_INVALID_VIRTUALADRESS,
    EE_TRANSFER_ERROR,

    /* Internal return code */
    EE_PAGE_NOTERASED,
    EE_PAGE_ERASED,
    EE_PAGE_FULL,
} EE_Status;

/* Define the size of the sectors to be used */
/* It does not necessarily be the number of words of the sector. If, for example, we have to use a sector
   of 128kb, using smaller page size results in faster operations.
   Unfortunatelly, whole pages have to be uses for this emulation to wort but, for better performance, declare just
   the required size */
#define FULL_PAGE_SIZE (uint32_t)0x10000 /* FULL page size (words) */
#define PAGE_SIZE (uint32_t)0x6000       /* REQUIRED page size (in bytes) */

/* EEPROM start address in Flash */
#define EEPROM_START_ADDRESS ((uint32_t)0x080C0000)

/* Pages 0 and 1 base and end addresses */
#define PAGE0_BASE_ADDRESS ((uint32_t)(EEPROM_START_ADDRESS + 0x0000))

#define PAGE1_BASE_ADDRESS ((uint32_t)(EEPROM_START_ADDRESS + (FULL_PAGE_SIZE)))

/* Variables number */
#define NB_OF_VAR (3000)

#define EE_DATA_STORED_TYPE uint16_t
#define EE_VIRTUALADDRESS_TYPE uint16_t

/* Exported types ------------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
EE_Status EE_Init(void);
EE_Status EE_ReadVariable(EE_VIRTUALADDRESS_TYPE, EE_DATA_STORED_TYPE *Data);
EE_Status EE_WriteVariable(EE_VIRTUALADDRESS_TYPE VirtAddress, EE_DATA_STORED_TYPE Data);
uint32_t EE_GetPageNumber(uint32_t Address);

#endif /* __EEPROM_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
